{
  "language": "english",
  "url": "https://www.rfi.fr/en/international/20241113-europe-has-avoided-bearing-burden-of-its-own-security-says-macron",
  "title": "Europe has 'avoided bearing burden of its own security', says Macron",
  "content": "Speaking alongside NATO Secretary General Mark Rutte in Paris following Donald Trump's re-election as US President, Macron said he was \"delighted\" that more nations were aligning with his push for collective investment in defence.\n\n\"It's the agenda of European strategic autonomy that will allow us to have more money, to build capacity and autonomy for the Europeans, and an ability to cooperate with our non-European allies as part of the alliance,\" Macron said.\n\nTrump has questioned Washington's commitment to NATO and has discussed reducing support to Ukraine or making a deal with Russia to end its invasion, which has dragged on for years.\n\nHis return to the White House pushes Europeans – long reliant on US military protection, both conventional and nuclear – to reconsider their own defence strategies.\"Nothing should be decided about Ukraine without the Ukrainians, nor about Europe without the Europeans,\" Macron said, calling the build-up of local military strength \"a long-term effort\".\n\nHe and Rutte condemned the presence of North Korean troops alongside Russian soldiers, describing it as \"a serious escalation\" in the Ukraine conflict, one that also heightens risks in the Pacific, now a key theatre for the US.\n\n\"Russia, working together with North Korea, Iran and China, is not only threatening Europe, it threatens peace and security, yes here in Europe, but also in the Indo-Pacific and North America,\" Rutte said.\n\n\"We must stand together – Europe, North America and our global partners. We have to keep our trans-atlantic alliance strong,\" he added.\n\nRutte pointed to backing Russia has received from Iran, North Korea and China.\n\n\"We must do more than just keep Ukraine in the fight. We need to raise the cost for (Russian President Vladimir) Putin and his enabling and authoritarian friends by providing Ukraine with the support it needs to change the trajectory of the conflict,\" he told reporters.",
  "repostedFrom": null
}